posts/prova-latex/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>prova latex | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/prova-latex/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="prova latex">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/prova-latex/">
<meta property="og:description" content="&lt;br&gt;
&lt;br&gt;





This is a private post where I keep a cheat sheet of working with
latex in org. 



Notice that nikola does not export proper latex chunks such as the one
below




α * π *  ∑iN





It">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-09-22T10:43:50+02:00">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="../../pages/foto-blog/" title="Foto Blog"><i class="fa fa-camera-retro"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">prova latex</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2019-09-22T10:43:50+02:00" itemprop="datePublished" title="2019-09-22 10:43">2019-09-22 10:43</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div class="HTML" id="org64bc17f">
<p>
&lt;br&gt;
&lt;br&gt;
</p>

</div>

<p>
This is a private post where I keep a cheat sheet of working with
latex in org. 
</p>

<p>
Notice that nikola does not export proper latex chunks such as the one
below
</p>

<div class="LaTeX" id="org06c3222">
<p>
α * π *  ∑<sub>i</sub><sup>N</sup></p>

</div>

<p>
It <i>does</i> however export built in latex statements such as the
formula below:
</p>

<p>
α * π *  ∑<sub>i</sub><sup>N</sup></p>

<p>
Test it in the following weeks.
</p>

<p>
Like that you can write posts about your learning in statistics in
possibly a fast way.
</p>

<div id="outline-container-orgaffb0f4" class="outline-2">
<h2 id="orgaffb0f4">Expression parsed?</h2>
<div class="outline-text-2" id="text-orgaffb0f4">
<p>
Notice that org does not parse latex expression as the one above in
<code>verbatim</code>. The text in such mode is literally represented.
</p>

<p>
The same holds for example chunks as the one below.
</p>

<pre class="example" id="org4b1e10e">
\alpha * \pi *  \sum_{i}^{N}
</pre>

<p>
nThe <b>best solution</b> is therefore to write the mathematical formula on
a separate line centering that.
</p>

<p>
The below does not work cause html does not parse latex functions but
it centers the text so it potentially works with all of the other
things you are interested to center.
</p>

<div class="HTML" id="org7c9f06a">
<p>
&lt;p style="text-align:center;"&gt;
α * π *  ∑<sub>i</sub><sup>N</sup>
&lt;/p&gt;
</p>

</div>

<p>
— still need to understand how to center. In the meanwhile just
    write on a separate line.
</p>

<div class="org-center">
<p>
begin center also does not work. If you ever consider to change the
behaviour and fix the centering it is advisable to manually change the
behaviour of this function. Probably mapped to some html of the wrong
format. There should be a conf.el source code somewhere defining how
the org expressions are converted and you can theoretically manually
adjust such file.
</p>
</div>
</div>
</div>

<div id="outline-container-org99a3ad4" class="outline-2">
<h2 id="org99a3ad4">
<span class="todo TODO">TODO</span> Latex plug-in</h2>
<div class="outline-text-2" id="text-org99a3ad4">
<p>
There is a latex plug-in in nikola.
</p>

<p>
It is not trivial to use the latter though. I tried to implement it by
downloading the two plug-ins:
</p>

<ul class="org-ul">
<li><a href="https://plugins.getnikola.com/v7/latex/">https://plugins.getnikola.com/v7/latex/</a></li>

<li><a href="https://plugins.getnikola.com/v7/latex_formula_renderer/">https://plugins.getnikola.com/v7/latex_formula_renderer/</a></li>
</ul>
<p>
Notice that the second package has many other dependencies I am not
sure to have captured.
</p>

<p>
I installed miktex here and now something is moving also in the auctex
on emacs. Try <code>C-c C-c</code> there. 
</p>

<p>
The issue continues to be the rendering in nikola. Cause it would
actually be very nice to have latex expressions for making complete
resumes and post all the statistics encounters there.
</p>

<p>
Go over it again whenever you have time.
</p>

<p>
Theoretically mathjax should already be built-in in both org and
nikola. For some reason the format is not rendering though.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside></article><footer id="footer"><p>Contents © 2022         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
